IDEA StatiCa Open Model
ConnectionData.CutBeamByBeams Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 cut beam by beams
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public List<CutBeamByBeamData> CutBeamByBeams { get; set; }
Public Property CutBeamByBeams As List(Of CutBeamByBeamData)
	Get
	Set
public:
property List<CutBeamByBeamData^>^ CutBeamByBeams {
	List<CutBeamByBeamData^>^ get ();
	void set (List<CutBeamByBeamData^>^ value);
}
Property Value
Type: List<CutBeamByBeamData>
See Also
Reference
ConnectionData Class
IdeaRS.OpenModel.Connection Namespace